# Задание 3: Задача про строку
a = input('Введите строку: ')
print(a[2], a[-2], a[0:5], a[0:-2], a[0::2], a[1::2], a[::-1], a[::-2], len(a), sep='\n')
